app/views/inventories/index.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."inventory_id" = ?  [[nil, 3]]
---
<div class="row">
  <% @inventory.line_items.each do |x| %>