app/views/inventories/show.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."inventory_id" = ?  [[nil, 3]]
---
  <ul>
	<% @inventory.line_items.each do |x| %>