app/views/quiz/catalog.html.erb

<%@lessons_for_print = Lesson.all%>
---
SELECT  "lessons".* FROM "lessons"  ORDER BY "lessons"."id" ASC LIMIT 1