app/controllers/characters_controller.rb

SELECT  "characters".* FROM "characters" WHERE "characters"."User_id" = 1  ORDER BY "characters"."id" ASC LIMIT 1
SELECT "inventories".* FROM "inventories" WHERE "inventories"."User_id" = 1
---
  def index
    @characters = Character.where(User_id: current_user)
    @inventories = Inventory.where(User_id: current_user)

SELECT  "characters".* FROM "characters" WHERE "characters"."User_id" = 1  ORDER BY "characters"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "characters" WHERE "characters"."User_id" = 1
---
  def new
    @characters = Character.where(User_id: current_user)
    if(@characters.size >= 1)

INSERT INTO "characters" ("hair", "skin", "shirt", "pants", "User_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["hair", "hair"], ["skin", "default"], ["shirt", "torso"], ["pants", "default"], ["User_id", 1], ["created_at", "2015-08-08 14:44:14.651647"], ["updated_at", "2015-08-08 14:44:14.651647"]]
INSERT INTO "inventories" ("User_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["User_id", 1], ["created_at", "2015-08-22 20:10:03.493226"], ["updated_at", "2015-08-22 20:10:03.493226"]]
---
  def create
    @inventory = Inventory.new
    @inventory.User_id = current_user.id
    @character = Character.new(character_params)
    @character.User_id = current_user.id
    @character.level = 1
    @character.xp = 0
    @character.gold = 200
    @character.helmet = "none"
    @character.armor = "none"
    @character.weapon = "none"
    @character.shield = "none"
    @character.wrong = 0
    @character.correct = 0
    respond_to do |format|
      if @character.save && @inventory.save

UPDATE "characters" SET "name" = ?, "User_id" = ?, "updated_at" = ? WHERE "characters"."id" = ?  [["name", ""], ["User_id", 1], ["updated_at", "2015-08-08 14:44:50.444918"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @character.update(character_params)

DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 1]]
SELECT "inventories".* FROM "inventories" WHERE "inventories"."User_id" = 1
DELETE FROM "inventories" WHERE "inventories"."id" = ?  [["id", 3]]
---
  def destroy
    @done_lessons = DoneLesson.where(character_id: @character.id)
    @done_lessons.each do |done_lesson|
      done_lesson.destroy
    end
    @character.destroy
    @inventories = Inventory.where(User_id: current_user)
    @inventories.each do |inventory|
      inventory.destroy

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_character
      @character = Character.find(params[:id])