app/controllers/inventories_controller.rb

SELECT "inventories".* FROM "inventories"
SELECT  "inventories".* FROM "inventories" WHERE "inventories"."User_id" = 1  ORDER BY "inventories"."id" ASC LIMIT 1
SELECT  "characters".* FROM "characters" WHERE "characters"."User_id" = 1  ORDER BY "characters"."id" ASC LIMIT 1
---
  def index
    @inventories = Inventory.all
    @inventory = Inventory.where(User_id: current_user).first
    @character = Character.where(User_id: current_user).first

DELETE FROM "inventories" WHERE "inventories"."id" = ?  [["id", 1]]
---
  def destroy
    @inventory.destroy

SELECT  "inventories".* FROM "inventories" WHERE "inventories"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_inventory
      @inventory = Inventory.find(params[:id])