app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "img", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Helmet"], ["img", "upg_helmet"], ["price", 100], ["created_at", "2015-08-22 19:51:56.553193"], ["updated_at", "2015-08-22 19:51:56.553193"]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "name" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "Elmo dourado"], ["updated_at", "2015-08-22 21:07:23.017099"], ["id", 1]]