app/controllers/lessons_controller.rb

  def index
    @lessons = Lesson.all
---
SELECT "lessons".* FROM "lessons"

  def create
    @lesson = Lesson.new(lesson_params)

    respond_to do |format|
      if @lesson.save
---
INSERT INTO "lessons" ("url", "subject", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["url", "DWkyl-1rkW4"], ["subject", "loops"], ["created_at", "2015-08-04 17:39:30.130383"], ["updated_at", "2015-08-04 17:39:30.130383"]]

  def destroy
    @lesson.destroy
---
DELETE FROM "lessons" WHERE "lessons"."id" = ?  [["id", 2]]

    def set_lesson
      @lesson = Lesson.find(params[:id])
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT 1  [["id", 2]]