app/controllers/line_items_controller.rb

SELECT  "characters".* FROM "characters" WHERE "characters"."User_id" = 1  ORDER BY "characters"."id" ASC LIMIT 1
SELECT  "inventories".* FROM "inventories" WHERE "inventories"."User_id" = 1  ORDER BY "inventories"."id" ASC LIMIT 1
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "characters" SET "gold" = ?, "updated_at" = ? WHERE "characters"."id" = ?  [["gold", 100], ["updated_at", "2015-08-23 22:36:47.745928"], ["id", 33]]
INSERT INTO "line_items" ("Item_id", "Inventory_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Item_id", 1], ["Inventory_id", 3], ["created_at", "2015-08-22 20:27:23.078333"], ["updated_at", "2015-08-22 20:27:23.078333"]]
---
  def create
    @character = Character.where(User_id: current_user).first
    @inventory = Inventory.where(User_id: current_user).first
    item = Item.find(params[:item_id])
    if item.price > @character.gold
      redirect_to store_index_path, notice: 'Voce não tem ouro suficiente'
    else
      @line_item = LineItem.new
      @line_item.Item = item
      @line_item.Inventory = @inventory
      @character.gold -= item.price
      @character.save

      respond_to do |format|
        if @line_item.save

UPDATE "characters" SET "gold" = ?, "updated_at" = ? WHERE "characters"."id" = ?  [["gold", 200], ["updated_at", "2015-08-23 22:35:46.617649"], ["id", 33]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 3]]
---
  def destroy
    @character.gold += @line_item.Item.price
    @character.save
    @line_item.destroy

SELECT  "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_line_item
      @line_item = LineItem.find(params[:id])