app/controllers/quiz_controller.rb

  def index
    @characters = Character.where(User_id: current_user)
    if(@characters.size >= 1)
  	   @lesson = Lesson.new(lesson_params)
  	   @video = @lesson.url
  	   @questions = Question.where(lesson: @lesson.subject).order("RANDOM()").limit(5)
---
SELECT  "characters".* FROM "characters" WHERE "characters"."User_id" = 1  ORDER BY "characters"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "characters" WHERE "characters"."User_id" = 1
SELECT  "questions".* FROM "questions" WHERE "questions"."lesson" = ?  ORDER BY RANDOM() LIMIT 5  [["lesson", "loops"]]

  def catalog
    @character = Character.where(User_id: current_user).first
---
SELECT  "characters".* FROM "characters" WHERE "characters"."User_id" = 1  ORDER BY "characters"."id" ASC LIMIT 1

  def answer
    @answer1 = params[:answer1]
    @answer2 = params[:answer2]
    @answer3 = params[:answer3]
    @answer4 = params[:answer4]
    @answer5 = params[:answer5]
    @statement1 = params[:statement1]
    @statement2 = params[:statement2]
    @statement3 = params[:statement3]
    @statement4 = params[:statement4]
    @statement5 = params[:statement5]
    @question1 = Question.where(statement: @statement1).first
    @question2 = Question.where(statement: @statement2).first
    @question3 = Question.where(statement: @statement3).first
    @question4 = Question.where(statement: @statement4).first
    @question5 = Question.where(statement: @statement5).first
    @answers = [@answer1, @answer2, @answer3, @answer4, @answer5]
    @lesson = Lesson.where(subject: @question1.lesson).first
    @character = Character.where(User_id: current_user).first
---
SELECT  "questions".* FROM "questions" WHERE "questions"."statement" = ?  ORDER BY "questions"."id" ASC LIMIT 1  [["statement", "x = 3+2. se x>5 escreva java senao escreva rails"]]
SELECT  "characters".* FROM "characters" WHERE "characters"."User_id" = 1  ORDER BY "characters"."id" ASC LIMIT 1

      @done_lesson.Lesson_id = @lesson.id
      @done_lesson.Character_id = @character.id
      @done_lesson.score = @result
      @done_lesson.save
---
UPDATE "characters" SET "xp" = ?, "gold" = ?, "level" = ?, "updated_at" = ? WHERE "characters"."id" = ?  [["xp", 0], ["gold", 125], ["level", 2], ["updated_at", "2015-08-23 22:39:43.712406"], ["id", 33]]