app/controllers/store_controller.rb

  def index
  	@items = Item.order(:name)
---
SELECT "items".* FROM "items"  ORDER BY "items"."name" ASC